# EditingColor Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ColorOptions..::..EditingColor Property
ColorOptions Class See Also
---
The color used to render elements when editing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public Color EditingColor { get; set; }
```

Visual Basic
---
```text
Public Property EditingColor As Color
	Get
	Set
```

Visual C++
---
```text
public:
property Color^ EditingColor {
	Color^ get ();
	void set (Color^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ColorOptions Class
Autodesk.Revit.DB Namespace